HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/gasMixing/injectorPipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (-0.5 -0.125 -0.25)
    (1.5 -0.125 -0.25)
    (1.5 0.125 -0.25)
    (-0.5 0.125 -0.25)
    (-0.5 -0.125 0.25)
    (1.5 -0.125 0.25)
    (1.5 0.125 0.25)
    (-0.5 0.125 0.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 4 8) simpleGrading (1 1 1)
);

edges
();
patches
();

// ************************************************************************* //
