HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/gasMixing/injectorPipe/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_air
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.095;
        value           uniform (0 0 0);
    }
    inlet_fuel
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.005;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      (0 0 0);
        value           $internalField;
    }
    "wall.*"
    {
        type            noSlip;
    }
    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
