HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/gasMixing/injectorPipe/0.orig/DtCparticulate
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      DtCparticulate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inlet_air
    {
        type            calculated;
        value           uniform 0.001;
    }
    inlet_fuel
    {
        type            calculated;
        value           uniform 0.001;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.001;
    }
    ".*"
    {
        type            calculated;
        value           uniform 0.001;
    }
}


// ************************************************************************* //
