HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/gasMixing/injectorPipe/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    inlet_air
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           $internalField;
    }
    inlet_fuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "inlet.*"
    {
        type            zeroGradient;
    }
    "wall.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
