HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/gasMixing/injectorPipe/system/avg-Cparticulate
// -*- C++ -*-
//
// Averaging of volume fields or fields on an externally loaded surface.
avg-Cparticulate-0.25
{
    ${settings_avg}
    subRegion   plane-0.25;
}

avg-Cparticulate-0.45
{
    ${settings_avg}
    subRegion   plane-0.45;
}

avg-Cparticulate-0.55
{
    ${settings_avg}
    subRegion   plane-0.55;
}


// ************************************************************************* //
