HELYXcore-4.4.0/examples/legacy/compressible/rhoSimpleFoam/gasMixing/injectorPipe/Allrun.mesh
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication helyxHexMesh -overwrite

rm -rf 0

#------------------------------------------------------------------------------
